noun = ["病患設定", "問診", "理學檢查", "初步鑑別", "檢查", "診斷", "評分"]
section_name = ["config", "test", "physical_exam", "pre_ddx", "examination", "diagnosis", "grade"]
icon = ["🩺", "📝", "🏥", "🧠", "🔬", "💊", "📚"]

intro = [
    ["歡迎 👋", "歡迎來到 PaTiENZ！", "請先完成病患設定並開始看診模擬", "在完成一區後可以選擇上一區補充紀錄"],
    ["開始問診", "在問診初步結束後，您可以利用理學檢查區進行進一步的檢查", "當你列出一些可能的疾病後，可按下完成問診以進入理學檢查區", "在病患思考問題回答時請勿切換分頁"],
    ["開始理學檢查", "請選擇要進行理學檢查的身體系統", "完成理學檢查後將進入初步鑑別診斷區"],
    ["初步鑑別診斷", "根據問診與理學檢查所得資訊，提出您的初步鑑別診斷清單", "並說明每個鑑別欲透過哪些檢查確認或排除", "此清單送出後將鎖定，作為後續評分依據"],
    ["開始檢查", "請選擇能夠鑑別病人疾病的檢查", "右側可參考您先前提出的初步鑑別清單", "確認完所有資訊後按下確認進入最終診斷"],
    ["最終診斷", "請和病人交代您的最終診斷結果與處置", "請標註初步鑑別清單中哪些已被排除、哪些保留，並可新增臨時想到的鑑別", "如有共病也請列出"],
    ["評分區", "歡迎來到評分區", "考官會給予您的表現評價", "如有需要，可在下方和考官進行進一步討論"]
]

avatar_map = {
    "student": "⚕️",
    "patient": "😥", 
    "advisor": "🏫",
    "doctor": "⚕️",
    "grader": "🏫"
}

default_all = [
    "血液檢驗",
    "糖尿病檢查",
    "動脈血氣分析",
    "靜脈血氣分析",
    "腎功能檢查",
    "凝血功能檢查",
    "血脂肪檢查",
]
